# Pandas for Data Science (Bangla Course)

Full Playlist: https://youtube.com/playlist?list=PLKdU0fuY4OFdsmcM817qp1L3ngU5amkak&si=GCnoLN-f8TgxfAF8 <br>
Connect with Author: https://www.linkedin.com/in/kmrashedulalam/

# Contents

1. Creating Series
2. Datatypes in Pandas

In [1]:
#install pandas
#!pip install pandas

In [2]:
#import pandas
import pandas as pd

# List to Series and DataFrame

Part 01 - https://youtu.be/YhBcUFAjCx0 <br>
Part 02 - https://youtu.be/Qmvi5IzAQjw <br>

In [3]:
# Create a list of data
data = [1,2,3,4,5,10]

In [4]:
data

[1, 2, 3, 4, 5, 10]

In [5]:
type(data)

list

In [6]:
# Create a Series from the list
s = pd.Series(data)
s

0     1
1     2
2     3
3     4
4     5
5    10
dtype: int64

In [7]:
type(s)

pandas.core.series.Series

In [8]:
# Create a DataFrame from the Series
df = pd.DataFrame(s, columns=['num'])
df

   num
0    1
1    2
2    3
3    4
4    5
5   10

In [9]:
data

[1, 2, 3, 4, 5, 10]

In [10]:
# Create a DataFrame from the Series
df1 = pd.DataFrame(data, columns=['num2'])
df1

   num2
0     1
1     2
2     3
3     4
4     5
5    10

In [11]:
s2 = df1['num2']

In [12]:
s2

0     1
1     2
2     3
3     4
4     5
5    10
Name: num2, dtype: int64

In [13]:
type(s2)

pandas.core.series.Series

In [14]:
#Create a series for 2 integer columns
data = [[1,2],[3,4],[5,8]]
data

[[1, 2], [3, 4], [5, 8]]

In [15]:
# Create a DataFrame from the list and rename the columns
df = pd.DataFrame(data, columns=['num1','num2'])

In [16]:
df

   num1  num2
0     1     2
1     3     4
2     5     8

In [17]:
# Create a Series from the DataFrame
s = df[['num1','num2']]
print(s)

   num1  num2
0     1     2
1     3     4
2     5     8

# Dictionary to Series and DataFrame

In [18]:
import pandas as pd

In [19]:
# Create a dictionary
data = {
    'name':['Rashedul', 'Zannat', 'Rishan'],
    'age': [25, 24, 23],
    'city': ['Erlangen','Nuremburg','Munich']
}

In [20]:
data

{'name': ['Rashedul', 'Zannat', 'Rishan'],
 'age': [25, 24, 23],
 'city': ['Erlangen', 'Nuremburg', 'Munich']}

In [21]:
# Create a Series from the dictionary
name_series = pd.Series(data['name'], name='Name')
name_series

0    Rashedul
1      Zannat
2      Rishan
Name: Name, dtype: object

In [22]:
df = pd.DataFrame(data)

In [23]:
df

       name  age       city
0  Rashedul   25   Erlangen
1    Zannat   24  Nuremburg
2    Rishan   23     Munich

In [24]:
age_series = df['age']

In [25]:
age_series

0    25
1    24
2    23
Name: age, dtype: int64

# Set to Series and DataFrame

In [26]:
s1 = {1,2,3,4,5,7,10}
s1

{1, 2, 3, 4, 5, 7, 10}

In [27]:
type(s1)

set

In [28]:
s = pd.Series(tuple(s1))
s

0     1
1     2
2     3
3     4
4     5
5     7
6    10
dtype: int64

In [29]:
df = pd.DataFrame(s1, columns=['set value'])
df

   set value
0          1
1          2
2          3
3          4
4          5
5          7
6         10

# Tuple to Series and DataFrame

In [30]:
t = (1,2,3,54,6, True, False)
s = pd.Series(t)
s

0        1
1        2
2        3
3       54
4        6
5     True
6    False
dtype: object

In [31]:
df = pd.DataFrame(t, columns=['set'])
df

     set
0      1
1      2
2      3
3     54
4      6
5   True
6  False

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   set     7 non-null      object
dtypes: object(1)
memory usage: 184.0+ bytes

# Numeric DataType in Pandas

In [33]:
import pandas as pd

In [34]:
# Creating a DataFrame with integer data
data = {'Age': [25, 30, 26, 28, 20, 22, 40, 28], 
        'Salary': [50000, 65000, 45000, 67000, 32000, 48000, 80000, 56000]}
df = pd.DataFrame(data)
df

   Age  Salary
0   25   50000
1   30   65000
2   26   45000
3   28   67000
4   20   32000
5   22   48000
6   40   80000
7   28   56000

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     8 non-null      int64
 1   Salary  8 non-null      int64
dtypes: int64(2)
memory usage: 256.0 bytes

In [36]:
df.dtypes

Age       int64
Salary    int64
dtype: object

In [37]:
# Changing data type to int32
df['Age'] = df['Age'].astype('int32')
df['Salary'] = df['Salary'].astype('int32')
df

   Age  Salary
0   25   50000
1   30   65000
2   26   45000
3   28   67000
4   20   32000
5   22   48000
6   40   80000
7   28   56000

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     8 non-null      int32
 1   Salary  8 non-null      int32
dtypes: int32(2)
memory usage: 192.0 bytes

In [39]:
2**32

4294967296

In [40]:
4294967296/2

2147483648.0

In [41]:
# -2147483648 to 2147483647

In [42]:
# Changing data type to int32
df['Age'] = df['Age'].astype('int16')
df['Salary'] = df['Salary'].astype('int16')
df

   Age  Salary
0   25  -15536
1   30    -536
2   26  -20536
3   28    1464
4   20   32000
5   22  -17536
6   40   14464
7   28   -9536

In [43]:
2**15

32768

In [44]:
#-32768 to 32767

In [45]:
# Creating a DataFrame with integer data
data = {'Age': [25, 30, 26, 28, 20, 22, 40, 28], 
        'Salary': [50000, 65000, 45000, 67000, 32000, 48000, 80000, 56000]}
df = pd.DataFrame(data)
df

   Age  Salary
0   25   50000
1   30   65000
2   26   45000
3   28   67000
4   20   32000
5   22   48000
6   40   80000
7   28   56000

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     8 non-null      int64
 1   Salary  8 non-null      int64
dtypes: int64(2)
memory usage: 256.0 bytes

In [47]:
# Changing data type to int32
df['Age'] = df['Age'].astype('float64')
df['Salary'] = df['Salary'].astype('float64')
df

    Age   Salary
0  25.0  50000.0
1  30.0  65000.0
2  26.0  45000.0
3  28.0  67000.0
4  20.0  32000.0
5  22.0  48000.0
6  40.0  80000.0
7  28.0  56000.0

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     8 non-null      float64
 1   Salary  8 non-null      float64
dtypes: float64(2)
memory usage: 256.0 bytes

# Object, Datetime Datatype

<h5>Here are some characteristics of the object dtype: </h5>

Heterogeneous Data: It can contain a mix of data types within a single column.

<ol> Flexibility: It can store a wide range of data types, making it versatile for handling diverse data. </ol> 

<ol> Performance Considerations: Operations on object columns can be slower compared to other data types due to the heterogeneity of data. </ol> 

<ol> Memory Usage: It can consume more memory compared to other data types, especially when dealing with large strings or complex objects. </ol> 

<h5>Common use cases for the object dtype include: </h5>

<ul> Unstructured Data: Storing text data, such as descriptions, comments, or URLs.</ul> 

<ul> Mixed Data: Handling columns that contain a combination of numeric and non-numeric values.</ul> 

<ul> Intermediate Calculations: Storing temporary results during data processing before converting to more specific data types.</ul>

In [49]:
import pandas as pd

In [50]:
# Create a dictionary with mixed data types
data = {'Name': ['Rashedul', 'Zannat', 'Rishan'],
        'Age': [27, 24, 22],
        'Occupation': ['Data Scientist', 'Software Engineer', 'Teacher'],
        'Salary': [60000, 55000, 70000]
       }

In [51]:
data

{'Name': ['Rashedul', 'Zannat', 'Rishan'],
 'Age': [27, 24, 22],
 'Occupation': ['Data Scientist', 'Software Engineer', 'Teacher'],
 'Salary': [60000, 55000, 70000]}

In [52]:
# Create a DataFrame and check the data types
df = pd.DataFrame(data)
print(df.dtypes)

Name          object
Age            int64
Occupation    object
Salary         int64
dtype: object

In [53]:
df

       Name  Age         Occupation  Salary
0  Rashedul   27     Data Scientist   60000
1    Zannat   24  Software Engineer   55000
2    Rishan   22            Teacher   70000

In [54]:
# Create a dictionary with mixed data types
data = {'Name': ['Rashedul', 'Zannat', 'Rishan'],
        'Age': [27, 24, 22],
        'Occupation': ['Data Scientist', 'Software Engineer', 'Teacher'],
        'Salary': ['60000 euro', '55000 euro', '70000 euro']
       }

In [55]:
# Create a DataFrame and check the data types
df = pd.DataFrame(data)
print(df.dtypes)

Name          object
Age            int64
Occupation    object
Salary        object
dtype: object

In [56]:
df

       Name  Age         Occupation      Salary
0  Rashedul   27     Data Scientist  60000 euro
1    Zannat   24  Software Engineer  55000 euro
2    Rishan   22            Teacher  70000 euro

# Datetime

In [57]:
# Create a list of dates
dates = ['2023-10-04', '2024-11-15', '2025-01-01']

# Create a DataFrame with a datetime column
df1 = pd.DataFrame({'Date': dates})

# Check the data type of the 'Date' column
df1['Date'].dtype

dtype('O')

In [58]:
timestamps = pd.to_datetime(dates)
df2 = pd.DataFrame({'Date2': timestamps})

In [59]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date2   3 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 152.0 bytes

In [60]:
# Create a list of dates
dates = ['2023', '2024-05-9', '2025']

# Create a DataFrame with a datetime column
df1 = pd.DataFrame({'Date': dates})

timestamps = pd.to_datetime(dates)
df2 = pd.DataFrame({'Date2': timestamps})

# Check the data type of the 'Date' column
df1['Date'].dtype

dtype('O')

In [61]:
df2['Date2'].dtype

dtype('<M8[ns]')

In [62]:
df2

       Date2
0 2023-01-01
1 2024-05-09
2 2025-01-01

In [63]:
dates = ['2023-10-04 12:34:56.123456789', '2023-11-15 15:23:45.987654321']
timestamps = pd.to_datetime(dates)
df = pd.DataFrame({'Date': timestamps})

print(df['Date'].dtype)

datetime64[ns]

In [64]:
df

                           Date
0 2023-10-04 12:34:56.123456789
1 2023-11-15 15:23:45.987654321

In [65]:
timestamps = pd.to_datetime(dates)
series = pd.Series(timestamps, name='dates')
series

0   2023-10-04 12:34:56.123456789
1   2023-11-15 15:23:45.987654321
Name: dates, dtype: datetime64[ns]